In [147]:
import pandas as pd
import os
Fname = input('Please enter in the filename')
df = pd.read_csv(Fname)
df

             0  2019-03-28 08:06:32  10642  60.29
0            1  2018-06-07 09:47:54  11141  36.71
1            2  2019-06-09 19:14:19  10120  19.92
2            3  2019-05-24 23:23:58  10714 -12.52
3            4  2018-09-10 05:42:41  10888  53.80
4            5  2018-07-26 14:53:36  10768   9.43
...        ...                  ...    ...    ...
999994  999995  2016-05-14 01:12:32  10703  43.46
999995  999996  2018-01-02 09:59:13  11152  19.89
999996  999997  2018-11-16 20:25:28  10037  29.45
999997  999998  2018-10-20 10:51:54  11358  41.11
999998  999999  2020-01-27 16:44:09  10154  43.97

[999999 rows x 4 columns]

In [148]:
path = 'D:\IntroCSE\Challenge 1/'
df = pd.read_csv(path + 'transactions_medium.csv')
print(df.head())

   0  2019-03-28 08:06:32  10642  60.29
0  1  2018-06-07 09:47:54  11141  36.71
1  2  2019-06-09 19:14:19  10120  19.92
2  3  2019-05-24 23:23:58  10714 -12.52
3  4  2018-09-10 05:42:41  10888  53.80
4  5  2018-07-26 14:53:36  10768   9.43

In [135]:
fr = []
all_length = []
for tm in os.listdir(path):
    if tm.endswith('.csv'):
        fp = path + tm 
        df1 = pd.read_csv(fp)      
        fr.append(df1)
        results = pd.concat(fr)
        length_month = len(df1.index)
        all_length.append(length_month)       
df = results
df.to_csv('Sales2019_all.csv', index=False)

In [136]:
print(sum(all_length))

373700

In [137]:
df['Month'] = df['Order Date'].str.slice(start= 0, stop=2, step= 1)
print(df.head(10))

  Order ID                     Product Quantity Ordered Price Each  \
0   141234                      iPhone                1        700
1   141235    Lightning Charging Cable                1      14.95
2   141236            Wired Headphones                2      11.99
3   141237            27in FHD Monitor                1     149.99
4   141238            Wired Headphones                1      11.99
5   141239      AAA Batteries (4-pack)                1       2.99
6   141240      27in 4K Gaming Monitor                1     389.99
7   141241        USB-C Charging Cable                1      11.95
8   141242  Bose SoundSport Headphones                1      99.99
9   141243    Apple Airpods Headphones                1        150

       Order Date                         Purchase Address Month
0  01/22/19 21:25          944 Walnut St, Boston, MA 02215    01
1  01/28/19 14:15         185 Maple St, Portland, OR 97035    01
2  01/17/19 13:33    538 Adams St, San Francisco, CA 94016    01
3  01/05/19 20:33       738 10th St, Los Angeles, CA 90001    01
4  01/25/19 11:59            387 10th St, Austin, TX 73301    01
5  01/29/19 20:22   775 Willow St, San Francisco, CA 94016    01
6  01/26/19 12:16       979 Park St, Los Angeles, CA 90001    01
7  01/05/19 12:04      181 6th St, San Francisco, CA 94016    01
8  01/01/19 10:30     867 Willow St, Los Angeles, CA 90001    01
9  01/22/19 21:20  657 Johnson St, San Francisco, CA 94016    01

In [138]:
df = df.dropna(how='all')
print(df.head())

  Order ID                   Product Quantity Ordered Price Each  \
0   141234                    iPhone                1        700
1   141235  Lightning Charging Cable                1      14.95
2   141236          Wired Headphones                2      11.99
3   141237          27in FHD Monitor                1     149.99
4   141238          Wired Headphones                1      11.99

       Order Date                       Purchase Address Month
0  01/22/19 21:25        944 Walnut St, Boston, MA 02215    01
1  01/28/19 14:15       185 Maple St, Portland, OR 97035    01
2  01/17/19 13:33  538 Adams St, San Francisco, CA 94016    01
3  01/05/19 20:33     738 10th St, Los Angeles, CA 90001    01
4  01/25/19 11:59          387 10th St, Austin, TX 73301    01

In [139]:
print(set(df['Month']))

{'02', '10', '12', '03', '08', '11', '06', 'Or', '04', '07', '09', '05', '01'}

In [140]:
df = df[df['Month'] != 'Or']
print(df.head())

  Order ID                   Product Quantity Ordered Price Each  \
0   141234                    iPhone                1        700
1   141235  Lightning Charging Cable                1      14.95
2   141236          Wired Headphones                2      11.99
3   141237          27in FHD Monitor                1     149.99
4   141238          Wired Headphones                1      11.99

       Order Date                       Purchase Address Month
0  01/22/19 21:25        944 Walnut St, Boston, MA 02215    01
1  01/28/19 14:15       185 Maple St, Portland, OR 97035    01
2  01/17/19 13:33  538 Adams St, San Francisco, CA 94016    01
3  01/05/19 20:33     738 10th St, Los Angeles, CA 90001    01
4  01/25/19 11:59          387 10th St, Austin, TX 73301    01

In [141]:
print(df['Quantity Ordered'].dtypes)
print(df['Price Each'].dtypes)

object
object

In [142]:
df['Quantity Ordered'] = pd.to_numeric(df['Quantity Ordered'], downcast='integer')
df['Price Each'] = pd.to_numeric(df['Price Each'], downcast='float')

In [143]:
df['Transaction'] = df['Price Each'] * df['Quantity Ordered']
print(df.head())

  Order ID                   Product  Quantity Ordered  Price Each  \
0   141234                    iPhone                 1  700.000000
1   141235  Lightning Charging Cable                 1   14.950000
2   141236          Wired Headphones                 2   11.990000
3   141237          27in FHD Monitor                 1  149.990005
4   141238          Wired Headphones                 1   11.990000

       Order Date                       Purchase Address Month  Transaction
0  01/22/19 21:25        944 Walnut St, Boston, MA 02215    01   700.000000
1  01/28/19 14:15       185 Maple St, Portland, OR 97035    01    14.950000
2  01/17/19 13:33  538 Adams St, San Francisco, CA 94016    01    23.980000
3  01/05/19 20:33     738 10th St, Los Angeles, CA 90001    01   149.990005
4  01/25/19 11:59          387 10th St, Austin, TX 73301    01    11.990000

In [144]:
df.groupby('Month')['Transaction'].mean()

Month
01    187.687378
02    183.884964
03    185.250473
04    185.495392
05    190.305847
06    190.187561
07    185.249832
08    187.648849
09    180.497391
10    184.238586
11    182.074951
12    184.655914
Name: Transaction, dtype: float32

In [145]:
transaction_value = df.groupby('Month')['Transaction'].mean()
result1 = transaction_value.max()
r1 = df.groupby('Month')['Transaction'].mean()
rp1 = pd.Series(r, dtype=('float32'))

for month, sales1 in transaction_value.items():
    if sales1 == result:
        print(f'Month is {month} with the maximum transaction value is {result}')

Month is 05 with the maximum transaction value is 190.30584716796875

In [146]:
result2 = transaction_value.min()
r2= df.groupby('Month')['Transaction'].mean()
rp2 = pd.Series(r2, dtype=('float32'))

for month, sales2 in transaction_value.items():
    if sales2 == result2:
        print(f'Month is {month} with the minimum transaction value is {result2}')

Month is 09 with the minimum transaction value is 180.4973907470703